Repository: fvdf/FlutterSweep
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# welcome
source: Welcome to FlutterSweep
es: Bienvenido a FlutterSweep
fr: Bienvenue dans FlutterSweep

# welcomeMessage
source: FlutterSweep helps you manage disk space by cleaning up Flutter project temporary files.
es: FlutterSweep te ayuda a administrar el espacio en disco limpiando archivos temporales de tus proyectos Flutter.
fr: FlutterSweep vous aide à gérer l'espace disque en nettoyant les fichiers temporaires de vos projets Flutter.

# chooseProjectFolder
source: Choose Flutter Projects Folder
es: Elegir carpeta de proyectos Flutter
fr: Choisir le dossier des projets Flutter

source: Settings
es: Configuración
fr: Paramètres

source: Language
es: Idioma
fr: Langue

source: Theme
es: Tema
fr: Thème

# themeLight
source: Light
es: Claro
fr: Clair

# themeDark
source: Dark
es: Oscuro
fr: Sombre

# themeSystem
source: System
es: Sistema
fr: Système

source: Archive Folder
es: Carpeta de archivos
fr: Dossier d'archives

source: Version
es: Versión

source: Re-scan
es: Re-escanear
fr: Re-scanner

# projectCount
source: Projects
es: Proyectos
fr: Projets

source: Total Size
es: Tamaño total
fr: Taille totale

source: Purgeable Size
es: Tamaño purgeable
fr: Taille purgeable

# tagIntact
source: Intact
es: Intacto

# tagPurgeSafe
source: Purge Safe
es: Purga segura
fr: Purge sûre

# tagArchive
source: Archive
es: Archivar
fr: Archiver

source: Search
es: Buscar
fr: Rechercher

source: All
es: Todos
fr: Tous

source: Purge Projects
es: Purgar proyectos
fr: Purger les projets

source: Archive Projects
es: Archivar proyectos
fr: Archiver les projets

source: Logs
es: Registros
fr: Journaux

# potentialSavings
source: FlutterSweep can potentially free up {size}
es: FlutterSweep puede liberar potencialmente {size}
fr: FlutterSweep peut potentiellement libérer {size}

source: Scanning...
es: Escaneando...
fr: Analyse en cours...

# noProjectsFound
source: No Flutter projects found
es: No se encontraron proyectos Flutter
fr: Aucun projet Flutter trouvé

source: Select Root Folder
es: Seleccionar carpeta raíz
fr: Sélectionner le dossier racine

source: Change Folder
es: Cambiar carpeta
fr: Changer de dossier

source: Root Folder
es: Carpeta raíz
fr: Dossier racine

source: Last Modified
es: Última modificación
fr: Dernière modification

# logStartingArchive
source: Starting archive operation
es: Iniciando operación de archivado
fr: Démarrage de l'opération d'archivage

# logPurgingTempFiles
source: Purging temporary files
es: Eliminando archivos temporales
fr: Suppression des fichiers temporaires

# logCreatedArchiveFolder
source: Created archive folder
es: Carpeta de archivos creada
fr: Dossier d'archives créé

# logCreatingZip
source: Creating ZIP archive
es: Creando archivo ZIP
fr: Création de l'archive ZIP

# logArchiveCreated
source: Archive created: {filename}
es: Archivo creado: {filename}
fr: Archive créée : {filename}

# logRemovingOriginal
source: Removing original project folder
es: Eliminando carpeta del proyecto original
fr: Suppression du dossier du projet original

# logArchiveCompleted
source: Archive operation completed successfully
es: Operación de archivado completada con éxito
fr: Opération d'archivage terminée avec succès

# logArchiveFailed
source: Archive operation failed: {error}
es: Falló la operación de archivado: {error}
fr: Échec de l'opération d'archivage : {error}

# logBulkArchiveStarted
source: Starting bulk archive operation
es: Iniciando archivado masivo
fr: Démarrage de l'archivage groupé

# logNoGitWarning
source: No Git repository detected - archive will be the only copy
es: No se detectó repositorio Git - el archivo será la única copia
fr: Aucun dépôt Git détecté - l'archive sera la seule copie

# logBulkArchiveCompleted
source: Bulk archive completed: {success} succeeded, {failed} failed
es: Archivado masivo completado: {success} exitosos, {failed} fallidos
fr: Archivage groupé terminé : {success} réussis, {failed} échoués

# logStartingPurge
source: Starting purge operation
es: Iniciando operación de purga
fr: Démarrage de l'opération de purge

# logPurgingFolder
source: Purging: {folder}
es: Purgando: {folder}
fr: Purge de : {folder}

# logPurgeCompleted
source: Purge completed successfully
es: Purga completada con éxito
fr: Purge terminée avec succès

# logPurgeFailed
source: Purge failed: {error}
es: Falló la purga: {error}
fr: Échec de la purge : {error}

# logBulkPurgeStarted
source: Starting bulk purge operation
es: Iniciando purga masiva
fr: Démarrage de la purge groupée

# logBulkPurgeCompleted
source: Bulk purge completed: {success} succeeded, {failed} failed
es: Purga masiva completada: {success} exitosos, {failed} fallidos
fr: Purge groupée terminée : {success} réussis, {failed} échoués

source: Archives
es: Archivos

# archivesPageTitle
source: Archived Projects
es: Proyectos archivados
fr: Projets archivés

source: No archives found
es: No se encontraron archivos
fr: Aucune archive trouvée

source: Open in Finder
es: Abrir en Finder
fr: Ouvrir dans le Finder

source: Archive Folder Location
es: Ubicación de la carpeta de archivos
fr: Emplacement du dossier d'archives

source: Archive Date
es: Fecha de archivo
fr: Date d'archivage

source: Archive Size
es: Tamaño del archivo
fr: Taille de l'archive

source: Total Archives
es: Total de archivos
fr: Total des archives

# totalArchivesSize
source: Total Size
es: Tamaño total
fr: Taille totale

source: Sort by:
es: Ordenar por:
fr: Trier par :

# sortByName
source: Name
es: Nombre
fr: Nom

# sortBySize
source: Size
es: Tamaño
fr: Taille

# sortByDate
source: Date
es: Fecha

source: Confirm Purge
es: Confirmar purga
fr: Confirmer la purge

# purgeMessage
source: You are about to purge {count} project(s):
es: Está a punto de purgar {count} proyecto(s):
fr: Vous êtes sur le point de purger {count} projet(s) :

# andMore
source: ... and {count} more
es: ... y {count} más
fr: ... et {count} de plus

source: Cancel
es: Cancelar
fr: Annuler

source: Purge
es: Purgar
fr: Purger

# purgeFailedMessage
source: Purge failed: {error}
es: Falló la purga: {error}
fr: Échec de la purge : {error}

source: Confirm Archive
es: Confirmar archivado
fr: Confirmer l'archivage

# archiveMessage
source: You are about to archive {count} project(s):
es: Está a punto de archivar {count} proyecto(s):
fr: Vous êtes sur le point d'archiver {count} projet(s) :

# archiveStep1
source: 1. Purge temporary files
es: 1. Purgar archivos temporales
fr: 1. Purger les fichiers temporaires

# archiveStep2
source: 2. Create a ZIP archive
es: 2. Crear archivo ZIP
fr: 2. Créer une archive ZIP

# archiveStep3
source: 3. Delete the original folder
es: 3. Eliminar carpeta original
fr: 3. Supprimer le dossier original

source: Archive
es: Archivar
fr: Archiver

# archiveFailedMessage
source: Archive failed: {error}
es: Falló el archivado: {error}
fr: Échec de l'archivage : {error}

source: Confirm Delete
es: Confirmar eliminación
fr: Confirmer la suppression

# deleteArchiveMessage
source: Are you sure you want to delete {name}?
es: ¿Está seguro de que desea eliminar {name}?
fr: Êtes-vous sûr de vouloir supprimer {name} ?

source: Delete
es: Eliminar
fr: Supprimer

source: Archive deleted
es: Archivo eliminado
fr: Archive supprimée

# errorOpeningFolder
source: Error opening folder: {error}
es: Error al abrir la carpeta: {error}
fr: Erreur lors de l'ouverture du dossier : {error}

# errorDeletingArchive
source: Error deleting archive: {error}
es: Error al eliminar el archivo: {error}
fr: Erreur lors de la suppression de l'archive : {error}

# errorScanning
source: Error scanning: {error}
es: Error al escanear: {error}
fr: Erreur lors de l'analyse : {error}
